acc1072.АвтоматизацияИнформированияДебиторов/src/Enums/Аид_ТипыСобытийОповещений/Аид_ТипыСобытийОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Аид_ТипыСобытийОповещений</name>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПросроченнаяЗадолженность</name>
  </enumValues>
  <enumValues>
    <name>ПлановыеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>ПлановыеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСостоянияЗаказа</name>
  </enumValues>
  <enumValues>
    <name>НачислениеБонусов</name>
  </enumValues>
  <enumValues>
    <name>СписаниеБонусов</name>
  </enumValues>
  <enumValues>
    <name>ВыпискаСчета</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСчета</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеСчета</name>
  </enumValues>
  <enumValues>
    <name>ОкончаниеОпроса</name>
  </enumValues>
</mdclass:Enum>

acc1072.АвтоматизацияИнформированияДебиторов/src/Enums/Аид_ТипыСобытийОповещений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак необходимости настройки регламентного задания.
//
// Параметры:
//  ТипСобытия  - ПеречисленияСсылка.ТипыСобытийОповещений - тип события оповещения, для которого получается признак.
//
// Возвращаемое значение:
//   Булево   - Истина, если настройка требуется.
//
Функция ТребуетсяНастройкаРегламентногоЗадания(ТипСобытия) Экспорт
	
	Если ТипСобытия = Перечисления.Аид_ТипыСобытийОповещений.ПросроченнаяЗадолженность
		ИЛИ ТипСобытия = Перечисления.Аид_ТипыСобытийОповещений.ПлановыеПлатежи
		ИЛИ ТипСобытия = Перечисления.Аид_ТипыСобытийОповещений.ПлановыеОтгрузки 
		ИЛИ ТипСобытия = Перечисления.Аид_ТипыСобытийОповещений.ОкончаниеОпроса Тогда
	
		Возврат Истина;
	
	Иначе
	
		Возврат ложь;
	
	КонецЕсли
	
КонецФункции

// Возвращает настройки типов событий, которые требуются при обработке очереди рассылок и оповещений.
//
// Параметры:
//  ТипСобытия  - ПеречисленияСсылка.ТипыСобытийОповещений - тип события оповещения, для которого получаются настройки.
//
// Возвращаемое значение:
//   Структура   - содержит настройки.
//       ПутьККонтактномуЛицу - Строка -путь к контактному лицу объекта оповещения от источника оповещения.
//       ОтправлятьПартнеру - Булево - признак того, что оповещения по типу можно отправлять партнерам.
//       ОтправлятьКонтактнымЛицамОбъектаОповещения - Булево - признак того, что оповещения по типу можно контактному
//                                                             лицу объекта оповещения.
//       ОтправлятьКонтактнымЛицамПартнера - Булево - признак того, что оповещения по типу можно отправлять контактным
//                                                    лицам партнера.
//       Имя - Строка - имя перечисления.
//
Функция ДанныеДляОбработкиОчередиОповещений(ТипСобытия) Экспорт
	
	СтруктураДанных = СтруктураДанныхДляОповещения();
	
	Если ТипСобытия = Перечисления.Аид_ТипыСобытийОповещений.ПросроченнаяЗадолженность Тогда
		
		СтруктураДанных.ОтправлятьКонтактнымЛицамОбъектаОповещения       = Ложь;
		СтруктураДанных.Имя                                              = "ПросроченнаяЗадолженность";
		

		
	Иначе
		
		СтруктураДанных.ОтправлятьКонтактнымЛицамОбъектаОповещения       = Ложь;
		СтруктураДанных.Имя                                              = "ПросроченнаяЗадолженность";     		
		
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураДанныхДляОповещения()

	СтруктураДанных = Новый Структура;

	СтруктураДанных.Вставить("ПутьККонтактномуЛицу", Неопределено);
	СтруктураДанных.Вставить("ОтправлятьКонтактнымЛицамОбъектаОповещения", Истина);
	СтруктураДанных.Вставить("ОтправлятьКонтрагенту", Истина);
	СтруктураДанных.Вставить("ОтправлятьКонтактнымЛицамКонтрагента", Истина);
	СтруктураДанных.Вставить("ВШаблонеДоступнаВнешняяСсылка", Ложь);
	СтруктураДанных.Вставить("МетаданныеИсточникаОповещения", Неопределено);
	СтруктураДанных.Вставить("ДоступноДляИспользования", Истина);
	СтруктураДанных.Вставить("Имя", Ложь);
	
	Возврат СтруктураДанных;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
